In [3]:
import numpy as np
import pandas as pd

data0=pd.Series(data=[1,2.,3,5,6,7,8])
data0

0    1.0
1    2.0
2    3.0
3    5.0
4    6.0
5    7.0
6    8.0
dtype: float64

In [4]:
data0=pd.Series(data=[1,2.,3,5,6,7,8], index=['a','b','c','d','e','f','a'])

In [8]:
# p=data0['a']
# p

'a' in data0

True

In [9]:
data0/4

a    0.25
b    0.50
c    0.75
d    1.25
e    1.50
f    1.75
a    2.00
dtype: float64

In [10]:
d=data0.copy()
d

a    1.0
b    2.0
c    3.0
d    5.0
e    6.0
f    7.0
a    8.0
dtype: float64

In [11]:
e=d/5
e

a    0.2
b    0.4
c    0.6
d    1.0
e    1.2
f    1.4
a    1.6
dtype: float64

In [20]:
data2={'Grades1':pd.series(data=[70,50,67,84,98],index=['Maths','Art','Biology'])}
Jupyter Notebook
Data Structure (autosaved) Current Kernel Logo 

Python 3

    File
    Edit
    View
    Insert
    Cell
    Kernel
    Widgets
    Help

1

import numpy as np

2

import pandas as pd

3

​

4

data0=pd.Series(data=[1,2.,3,5,6,7,8])

5

data0

6

​

0    1.0
1    2.0
2    3.0
3    5.0
4    6.0
5    7.0
6    8.0
dtype: float64

1

data0=pd.Series(data=[1,2.,3,5,6,7,8], index=['a','b','c','d','e','f','a'])

1

# p=data0['a']

2

# p

3

​

4

'a' in data0

True

1

data0/4

a    0.25
b    0.50
c    0.75
d    1.25
e    1.50
f    1.75
a    2.00
dtype: float64

1

d=data0.copy()

2

d

a    1.0
b    2.0
c    3.0
d    5.0
e    6.0
f    7.0
a    8.0
dtype: float64

1

e=d/5

2

e

a    0.2
b    0.4
c    0.6
d    1.0
e    1.2
f    1.4
a    1.6
dtype: float64

SyntaxError: invalid syntax (<ipython-input-20-08933dc579b8>, line 2)

In [26]:

data2={'Grades1':pd.Series(data=[70,50,67,84,98],index=['Maths','Art','Physics','Biology','chemistry']),
      
       'Grades2':pd.Series(data=[90,70,88,78,76,77,87],index=['Maths','Biology','Physics','Chemistry','Economics','Finance','Geography'])}

data2=pd.DataFrame(data2)
data2

           Grades1  Grades2
Art           50.0      NaN
Biology       84.0     70.0
Chemistry      NaN     78.0
Economics      NaN     76.0
Finance        NaN     77.0
Geography      NaN     87.0
Maths         70.0     90.0
Physics       67.0     88.0
chemistry     98.0      NaN

In [24]:
data3 = {'GradeS1': pd.Series(data = [70,50,67,84,98], 
                              index = ['Maths', 'Art', 'Sport', 'Biology', 'Physics']),
         'GradeS2': pd.Series(data = [90,70,88,78,76,77,87], 
                              index = ['Maths', 'Biology', 'Physics', 'chemistry', 'Economics', 'Finance', 'Geology'])}
data3 = pd.DataFrame(data3)
data3

           GradeS1  GradeS2
Art           50.0      NaN
Biology       84.0     70.0
Economics      NaN     76.0
Finance        NaN     77.0
Geology        NaN     87.0
Maths         70.0     90.0
Physics       98.0     88.0
Sport         67.0      NaN
chemistry      NaN     78.0

In [10]:
import pandas as pd
data4={'Height':[10,12,13,14,44],'Grade2':[10,30,40,50,80]}
data4=pd.DataFrame(data4, index=['sts','hshg','ghgd','hjhfd','hjs'])

In [11]:
data4

       Height  Grade2
sts        10      10
hshg       12      30
ghgd       13      40
hjhfd      14      50
hjs        44      80